In [7]:
import pandas as pd
df = pd.read_csv('mark.csv')

In [8]:
df

   Roll No      Name  Marks
0       60   Thushar     86
1       62     Varun     54
2       59   Thomson     65
3       42    Jisnoy     76
4       57  Sidharth     42

In [4]:
df.sort_values('Roll No')

   Roll No      Name  Marks
3       42    Jisnoy     76
4       57  Sidharth     42
2       59   Thomson     65
0       60   Thushar     86
1       62     Varun     54

In [5]:
df.sort_values('Name')

   Roll No      Name  Marks
3       42    Jisnoy     76
4       57  Sidharth     42
2       59   Thomson     65
0       60   Thushar     86
1       62     Varun     54

In [6]:
df.sort_values('Marks')

   Roll No      Name  Marks
4       57  Sidharth     42
1       62     Varun     54
2       59   Thomson     65
3       42    Jisnoy     76
0       60   Thushar     86